/**
  ******************************************************************************
  * @文件         led.h
  * @作者         LGG
  * @版本         V1.0.0
  * @日期         2017-11-15
  * @摘要         led头文件
  ******************************************************************************
*/ 

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef __LED__H
#define __LED__H

/* 包含头文件 ----------------------------------------------------------------*/
#include "stm8s.h"

/* 宏定义 --------------------------------------------------------------------*/
/* 定义LED1 IO PORT与PIN */
#define LED1_GPIO_PORT  (GPIOD)
#define LED1_GPIO_PINS  (GPIO_PIN_6)

/* 定义LED2 IO PORT与PIN */
#define LED2_GPIO_PORT  (GPIOD)
#define LED2_GPIO_PINS  (GPIO_PIN_5)

/* 函数声明-------------------------------------------------------------------*/
void LED_Init(void);
#endif

/************************ Copyright (C)2017 LGG. All Rights Reserved *****END OF FILE****/
